org/_posts/2017-04-19-chunks.org
#+STARTUP: showall indent
#+STARTUP: hidestars
#+OPTIONS: H:2 num:nil tags:nil toc:nil timestamps:nil
#+BEGIN_EXPORT html
---
layout: post
title: Chunks
categories: attempts
---
#+END_EXPORT

** Chunks
   No, not the vomit kind. Okay maybe.

   As I've prattled on about before, human beings spend a lot of time
   either /a)/ subconsciously sorting things into categories (right,
   wrong, dark, light, progress, regress, etc) or /b)/ consciously
   deciding what categories things go in, with an awareness that the
   categories are fuzzy and the points don't matter and live from new
   york it's saturday night. You can try, but you can't escape it, and
   in this weird wide world containing the internet, where we can be
   exposed to any ideas that we choose, and in the privacy of our own
   homes make decisions about how we are going to engage with those
   ideas, we need to hone our metacognitive
   skills. Meta-metacognitive? Idk. You get the
   concept. Concept. Concept. Say it three times and turn in a
   circle. Concepts are... what? Ideas? Beliefs? Grouping of those
   things?

   Categories are tangent to what I want to talk about, concepts are
   adjacent to it: the bit I need is the psychological concept of the
   [[https://en.wikipedia.org/wiki/Chunking_(psychology)][chunk]]. Chunking, and the paper that first synthesized the concept,
   "/The Magical Number Seven, Plus or Minus Two: Some Limits on Our
   Capacity for Processing Information/," are such cultural staples
   that any writing on the topic is bound to seem trite, but here we
   go. The important bit is this:

   #+BEGIN_QUOTE
   A chunk is defined as a familiar collection of more elementary units
   that have been inter-associated and stored in memory repeatedly and
   act as a coherent, integrated group when retrieved. -- Wikipedia

   -- Tulving, E., & Craik, F
   #+END_QUOTE

   Chunks are psychic objects, the basic building blocks with which we
   assemble our working memory, and thereby our thought. It doesn't
   matter if a chunk is a single binary digit, or a re-coding into
   higher space therefrom, or the entire idea of "whale", or "pizza",
   or "nazism", or "blog." Our largest chunks confine our largest
   thoughts. Chunks are how we contemplate the world. Refinement of
   our chunks is refinement of our consciousness. This is how
   "chunking" can be tidily inverted, now a big glass bowl
   encompassing some of the more political and philosophical things
   that we can discuss.

   Chunking is sublimely underrated as a tool for more effective
   understandings of consciousness and the workings therein.

   I'm aware of one other work on this topic, and a neat, Maria Popova
   summary is available [[https://www.brainpickings.org/2012/09/04/the-ravenous-brain-daniel-bor/][here]]. I haven't read the book, but it
   certainly seems interesting, and a definitively more scientific
   description than the allusions, metaphors, and inanity offered
   herein.

   To be aware that chunking is necessary, chunking is largely
   unconscious, chunking is how we are socialized, and chunking is the
   product of our own personal investigation, is to be aware of the
   forces that divide, and the forces that unite us in
   humanity. Education can become "tools to encourage re-chunking."
   Drugs "encourage the rapid disintegration of chunks." Inspiration
   contains the "rapid expansion of a chunk to contain new contexts."

   It's criminally easy to abuse the metaphor (chunk) of chunks, and
   it sounds insane, which is why I've tried to explain these things
   to exactly zero people.

*** Ontology
    Ontology is concerned with reality and its categories. It's one
    big arm of metaphysics (that statement itself being an ontological
    assessment), and it's everywhere. You just have to know where to
    look.

    Reasoning about the nature of reality, about the fundamental
    properties of a thing, about what markers are needed to fill the
    requirements of an /identity/, questions of /self/ versus /other/
    and /in-group/ versus /out-group/, these are actually (and often
    unconsciously) works of ontology.

    What the nonsensical introduction was getting at, then, is that,
    like it or not, we spend an inordinate amount of time doing
    (committing?) /ontology/.

    Ontology, neurologically speaking, could just be the study of
    chunks. I'm willing to bet enough on this to type words into a
    computer, so I'd say I'm pretty sure. Since ontology is focused on
    the boundaries of things, and chunks are the psychic set of
    boundaries between concepts, objects, and more, chunks are a
    superset of ontology.

    Ontology is also in charge of the categories themselves. You
    cannot determine what category an item belongs to without first
    having a list of categories. Categories are established through
    the process of comparison that identifies "like" things.

    When we say that one thing is like another thing, we've made a
    metaphor, and we're thinking analogically. Categorization /is/
    metaphorization.

