jekyll/_posts/2017-04-19-chunks.html

<div id="outline-container-org7db73b9" class="outline-3">
<h3 id="org7db73b9">Semantics</h3>
<div class="outline-text-3" id="text-org7db73b9">
<p>
I made a groaner the other night, realizing that semantics is
metaphor without hyperbole &#x2013; the unit metaphor is straightforward
and useful. Of course, if there are unit metaphors, then maybe
there are scalar metaphors, or metaphor transforms. Who knows?
</p>

<p>
A chair is a construction of wood, cushion, or otherwise, that
facilitates sitting. A stool is like a chair, but dumber. You
prefer stools? Psychopath.
</p>

<p>
Her eyes were cerulean kiddie pools. Her eyes were bubbles of
fluid for focusing light on a sensor. It's not pretty, but it gets
the job done.
</p>

<p>
The very descriptive act is one of comparison, the decision that
things are like other things.
</p>

<blockquote>
<p>
We get it poets: things are like other things
</p>

<p>
&#x2013; <a href="https://twitter.com/shutupmikeginn/status/508799244778889216">Mike "Writer" Ginn</a>
</p>
</blockquote>

<blockquote>
<p>
also, comedians / yes&#x2026; comedians are like poets
</p>

<p>
&#x2013; in the @ replies
</p>
</blockquote>

<p>
Funny joke! Creative, collective definition is all of our
jobs&#x2026; some people are just more aware of it than others.
</p>

<p>
Semantics is fundamentally description, description is
fundamentally metaphor, and metaphor fundamentally chunking. We're
captive on a carousel of time. Every time I say fundamentally I
draw a big red circle around my categorization impulse and further
entrench this stupid chunking idea.
</p>

<p>
As we unroll semantics and look more deeply at what words and
definitions <i>are</i>, <a href="http://psycnet.apa.org/journals/xlm/16/5/852.html">semantic</a> <a href="https://en.wikipedia.org/wiki/Semantic_satiation">satiation</a> seems to wink wink nudge
nudge at deep neurological implications. When we use a word into
total exhaustion we temporarily rob our mind of the word's
usefulness. We lose its <i>meaning</i>, its <i>chunk</i>, its metaphorical,
ontological <i>way of being</i>. The hole it leaves is terrifying. How
did you spend so long with the sense of this thing, only to lose
it into the ether? Even more terrifyingly, related concepts are
<i>also</i> weakened. If we lose our "table" chunk, we weaken our
"desk" chunk. The miasma of an idea, the metaphorical and physical
relatedness of the building blocks of our consciousness, can be
partially dissolved by the words we choose to assign them.
</p>

<p>
Is this why repeated chants channel such great power? Is it that
filling the mind with (what are now) nonsense syllables clears
your pool of conscious thought and makes space for something less
verbal? Something closer to god?
</p>

<p>
Is the inverse phenomena of <a href="https://en.wikipedia.org/wiki/Glossolalia">glossolalia</a> just that? Nonsense
syllables of a cleared mind? Is glossolalic interpretation hearing
nonsense and understanding, while semantic satiation is hearing
real words and failing?
</p>
</div>
</div>

<div id="outline-container-org683da68" class="outline-3">
<h3 id="org683da68">Jargon</h3>
<div class="outline-text-3" id="text-org683da68">
<p>
Jargon seems like an arbitrary barrier to entry for any given
academic field. It's arcane, it's needlessly complicated, it's
elitist, and it seems, from an outsider's perspective, that
regular ol' words will do just fine, thank you.
</p>

<p>
People "<a href="https://en.wikipedia.org/wiki/Ontology_engineering">in the know</a>" already know that the entirety of a field's
jargon is its "ontology." When there was a push for the "Semantic
Web," ontology was also the chunk they used to represent domain
knowledge, saying, in one common example, that a book site would
use "author" where a more general site might use "creator." Author
is more descriptive than creator. It captures more information
&#x2013;more context&#x2013; than creator, and represents a larger chunk.
</p>

<p>
Jargon, domain knowledge, ontology, chunks&#x2013; these things capture
information much more complex than simple words, their phonemes,
or even their definitions. When you enter a specialized field
these chunks contain increasingly large amounts of
information. Eventually some information is added that causes one
chunk to diverge from a previous version. To distinguish new
chunks from older chunks, new vocabulary is invented.
</p>

<p>
It is when working with these complex ideas that jargon becomes
desirable, since specialized vocabulary is imbued with the
potentiality of triggering chunk loads, allowing the reader or
thinker to access larger and larger pieces of information
simultaneously.
</p>

<p>
The cargo-cultist possesses the half of a chunk that is
superficially available, without bothering to (or knowing enough
to) ferret out more deep and nuanced meaning. It is always the job
of philosophers (and <i>Doctors of Philosophy in <span class="underline"><span class="underline">__</span></span></i>) to
spend enough time with the meanings of things that the whole
chunks are uncovered and the full context made apparent once
again.
</p>
</div>
</div>

<div id="outline-container-orgd0e2f64" class="outline-3">
<h3 id="orgd0e2f64">Vocabulary Words / Foreign Words</h3>
<div class="outline-text-3" id="text-orgd0e2f64">
<p>
Sometimes true meanings are obliterated by our proximity to
them.
</p>

<p>
Boredom is a powerful chunk containing dissatisfaction with the
state of reality and the urge to escape it. It is listlessness and
aimlessness and existential anxiety. How often do we unpack
boredom? When we speak "boredom" do we expect our listeners to
unpack the chunk and actually feel something? Maybe it's easier to
use a word that makes us work a little harder, allowing us to
become aware of its subtlety as we think. How about <i>ennui</i>?
<i>Ennui</i> is beautiful, and for me has always captured the more
"real" bits of boredom. I'm not bored of an activity. Activities
are easy to find. Maybe I'm bored of <i>all</i> of this.
</p>

<p>
Maybe <i>ennui</i> is already too loaded, "loading" in this context is
a flattening of our chunks so that they look, from the outside,
like things much less complex than they are, removing the
intensity of meaning in a hedonic treadmill. Thoughts can only
move us for so long. Cargo cults are shallow, like the
understanding gleaned from <a href="{% post_url 2017-03-01-travel-blog %}">visiting</a> a place, but never living
there.
</p>

<p>
Other times, however, a language is entirely missing a word to
capture a particular chunk. It somewhat bothers me when I see
"untranslatable words" or things of that ilk, because of course
english is infinitely expressive, and what they mean is that there
is no single word translation. But, when brevity is desired or you
would like to instantly trigger the loading of a particular,
<i>huge</i> chunk, using a foreign word is infinitely more
efficient. At this point foreign words become jargon for our
everyday experience.  <i>Fremdschämen</i> from German, <i>Saudade</i> from
Portuguese, the <i>Vus</i> from French. These words have no "simple"
translation, but immediately and thoroughly capture potent
chunkcepts. I've wept over beautiful words. This is okay. I'm
fine.
</p>
</div>
</div>
