org/_posts/2017-04-19-chunks.org
*** Genius and a few good chunks
    I read somewhere [citation needed(probably from inside the
    rationality-web)] that even the most genius people have only a few
    good tricks: a set of mental tools by which they approach every
    problem. If their tricks don't work, maybe file the problem away
    for a while until new tricks can be learned or new information can
    be gleaned about the problem itself. Being productive dictates
    shelving unpleasant problems from time to time.

    Anyway, the tricks are reductions, incarnations of the analogical thinking
    that ontology empowers. The question is always 'is this problem
    "like" another problem?' Is there an approach I know that works
    here, too? Are the logical threads the same?  Are the crossings of
    rope unique to this problem not so unique after all?  Is it the
    same knot in a different context? I've wept over the same knots in
    different contexts. This is okay. I'm fine.

    Computicians[sic] are already directly aware of these workings:
    progress in this field almost always occurs via the reduction of
    one problem to another -- what once seemed intractable now
    accessible through the arcane machinations and mathematics of
    yore. If one problem is reducible to another, it is already
    solved.

    As we've seen, most work is just figuring out what things are like
    other things anyway. Poetry. /Poiesis/. Creation.

*** Personal Revelation as "new chunk"
    /ker-chunk!/

    That's the sound of a new metaphor falling into place, your new
    analogy another brick in the wall of Knowledge. You've compared
    two things, and now you understand. This is the nature of
    knowledge, that text is nothing without context.

    By comparing two things, you've encouraged their chunks to merge,
    you're blurring the boundary between one thing and another. We can
    say, when speaking analogically, "of course I don't /literally/
    mean that one thing is like another, but of course it is. It is if
    our unit metaphors are tight enough.

    The moment of epiphany is a spectacular subduction of one chunk by
    another, the sublime rumblings of expanding definitions and better
    comparisons, stories to tell yourself that feel more whole, and a
    better angle on the facts.

    Epiphany feels so good because your brain finally knows where to
    put things. What a relief.

*** Explainers, and encouraging others to "Get It"
    If this blog has a purpose, it is to realign your perception of
    the world to be just a little bit more similar to my own. This is
    often the goal of "explainers," articles, videos, books, that are
    an attempt by one human to explain something to another. Sometimes
    this works well, and is necessary, like apprenticeships in trades
    and membership in dojos for the physical arts. Sometimes it seems
    to fall flat, like in the case of personal advice columns and
    self-help books.

    When we explain, if we feel frustration at someone else not
    "getting it" they either haven't heard us correctly, or their
    information is chunked such that whatever new info you've provided
    is being sorted into a pile that might not even exist in your
    brain.

    Sometimes these piles can be the source of our greatest
    naïvetés. Progress -- new, better perspectives, are available to
    those who are just now in the process of building up their chunks,
    and much can be gained by questioning the validity of some of our
    more "fundamental" chunks. Gender is a good chunk to break
    apart. Gender contains a lot of information, and has historically
    been very useful. But gender chunks contain humans, and humans are
    tricky.

    In this case we may do well to chunk less information in gender,
    and work more slowly out from there.

    Or maybe we would do better to chunk /more/ information with
    gender, including more information about ambiguity, spectrum, and
    complexity. In this case we must still make sure we don't become
    desensitized to meaning-- we must unpack gender every time we
    speak of it.

    Maybe the real trick is only to use foreign words for gender.

    I've gotten derailed. I hope when you pick up your chunks you find
    them healthy and whole.
