jekyll/_posts/2017-04-19-chunks.html

<div id="outline-container-org3c0aaab" class="outline-3">
<h3 id="org3c0aaab">Genius and a few good chunks</h3>
<div class="outline-text-3" id="text-org3c0aaab">
<p>
I read somewhere [citation needed(probably from inside the
rationality-web)] that even the most genius people have only a few
good tricks: a set of mental tools by which they approach every
problem. If their tricks don't work, maybe file the problem away
for a while until new tricks can be learned or new information can
be gleaned about the problem itself. Being productive dictates
shelving unpleasant problems from time to time.
</p>

<p>
Anyway, the tricks are reductions, incarnations of the analogical thinking
that ontology empowers. The question is always 'is this problem
"like" another problem?' Is there an approach I know that works
here, too? Are the logical threads the same?  Are the crossings of
rope unique to this problem not so unique after all?  Is it the
same knot in a different context? I've wept over the same knots in
different contexts. This is okay. I'm fine.
</p>

<p>
Computicians[sic] are already directly aware of these workings:
progress in this field almost always occurs via the reduction of
one problem to another &#x2013; what once seemed intractable now
accessible through the arcane machinations and mathematics of
yore. If one problem is reducible to another, it is already
solved.
</p>

<p>
As we've seen, most work is just figuring out what things are like
other things anyway. Poetry. <i>Poiesis</i>. Creation.
</p>
</div>
</div>

<div id="outline-container-org1653ead" class="outline-3">
<h3 id="org1653ead">Personal Revelation as "new chunk"</h3>
<div class="outline-text-3" id="text-org1653ead">
<p>
<i>ker-chunk!</i>
</p>

<p>
That's the sound of a new metaphor falling into place, your new
analogy another brick in the wall of Knowledge. You've compared
two things, and now you understand. This is the nature of
knowledge, that text is nothing without context.
</p>

<p>
By comparing two things, you've encouraged their chunks to merge,
you're blurring the boundary between one thing and another. We can
say, when speaking analogically, "of course I don't <i>literally</i>
mean that one thing is like another, but of course it is. It is if
our unit metaphors are tight enough.
</p>

<p>
The moment of epiphany is a spectacular subduction of one chunk by
another, the sublime rumblings of expanding definitions and better
comparisons, stories to tell yourself that feel more whole, and a
better angle on the facts.
</p>

<p>
Epiphany feels so good because your brain finally knows where to
put things. What a relief.
</p>
</div>
</div>

<div id="outline-container-org0c16f3a" class="outline-3">
<h3 id="org0c16f3a">Explainers, and encouraging others to "Get It"</h3>
<div class="outline-text-3" id="text-org0c16f3a">
<p>
If this blog has a purpose, it is to realign your perception of
the world to be just a little bit more similar to my own. This is
often the goal of "explainers," articles, videos, books, that are
an attempt by one human to explain something to another. Sometimes
this works well, and is necessary, like apprenticeships in trades
and membership in dojos for the physical arts. Sometimes it seems
to fall flat, like in the case of personal advice columns and
self-help books.
</p>

<p>
When we explain, if we feel frustration at someone else not
"getting it" they either haven't heard us correctly, or their
information is chunked such that whatever new info you've provided
is being sorted into a pile that might not even exist in your
brain.
</p>

<p>
Sometimes these piles can be the source of our greatest
naïvetés. Progress &#x2013; new, better perspectives, are available to
those who are just now in the process of building up their chunks,
and much can be gained by questioning the validity of some of our
more "fundamental" chunks. Gender is a good chunk to break
apart. Gender contains a lot of information, and has historically
been very useful. But gender chunks contain humans, and humans are
tricky.
</p>

<p>
In this case we may do well to chunk less information in gender,
and work more slowly out from there.
</p>

<p>
Or maybe we would do better to chunk <i>more</i> information with
gender, including more information about ambiguity, spectrum, and
complexity. In this case we must still make sure we don't become
desensitized to meaning&#x2013; we must unpack gender every time we
speak of it.
</p>

<p>
Maybe the real trick is only to use foreign words for gender.
</p>

<p>
I've gotten derailed. I hope when you pick up your chunks you find
them healthy and whole.
</p>
</div>
</div>
</div>
